myFunction([
  {
    "registered": "Thursday, February 19, 2015 3:36 AM",
    "content": "Qui quis eu eu ut velit dolore non velit ad. Irure ex consequat est consequat commodo culpa in cupidatat cillum. Amet ut elit labore id Lorem culpa et ullamco tempor eu in pariatur ex incididunt. Laboris magna aliqua adipisicing ex in consectetur incididunt adipisicing. Cupidatat occaecat deserunt dolore aute enim. Quis id aute sunt sint exercitation tempor non magna minim.",
    "name": {
      "last": "York",
      "first": "Jasmine"
    },
    "shareCount": 5,
    "commentCount": 9,
    "likeCount": 4,
    "doesLike": false,
    "_id": "55f7ec4c6bb3313bae67c148"
  },
  {
    "registered": "Wednesday, March 18, 2015 1:26 PM",
    "content": "Eiusmod ut magna in eu culpa est adipisicing commodo aute mollit ipsum deserunt. Deserunt voluptate enim cillum laboris nostrud. Laboris ut veniam elit excepteur dolor consectetur id magna velit ex ut aliquip. Officia in ex dolore ipsum consequat anim culpa. Sunt elit ipsum Lorem enim velit. In nostrud sit non pariatur. Laboris nostrud ut proident eu exercitation labore elit qui tempor excepteur veniam ipsum non ad.",
    "name": {
      "last": "Fry",
      "first": "Cochran"
    },
    "shareCount": 7,
    "commentCount": 9,
    "likeCount": 0,
    "doesLike": false,
    "_id": "55f7ec4cd632aee6063c8806"
  },
  {
    "registered": "Saturday, March 14, 2015 9:33 PM",
    "content": "Do aliquip voluptate aliquip quis do in esse cupidatat ex consequat veniam nostrud ad. Sunt sint ipsum reprehenderit cupidatat ullamco laborum esse ad. Exercitation laboris anim commodo quis dolor. Aute dolore ullamco est nulla laborum exercitation aliqua enim.",
    "name": {
      "last": "Ellis",
      "first": "Hale"
    },
    "shareCount": 3,
    "commentCount": 1,
    "likeCount": 6,
    "doesLike": true,
    "_id": "55f7ec4c78528e7899284bfa"
  },
  {
    "registered": "Friday, August 21, 2015 7:27 AM",
    "content": "Excepteur reprehenderit occaecat excepteur commodo. Ut officia cillum ullamco labore culpa elit. Incididunt in sint mollit laboris in in ut magna eu exercitation dolore irure Lorem. Incididunt occaecat voluptate voluptate exercitation veniam eu mollit ipsum irure sunt aliqua aliqua laborum do. Eu enim minim tempor culpa aute duis duis. Excepteur cupidatat mollit adipisicing in ullamco eu. Ut quis culpa voluptate esse magna aliquip aliquip ut nostrud cillum.",
    "name": {
      "last": "Beard",
      "first": "Serena"
    },
    "shareCount": 7,
    "commentCount": 0,
    "likeCount": 7,
    "doesLike": true,
    "_id": "55f7ec4c140ae9c5eedbfd3c"
  }
]);